app/User.php

select `section_id` from `permissions` where `role_id` = 2 and `allow` = 1
---
    public function hasPermission($section_name)
    {
        if (self::isAdmin()) {
            if (!isset($this->permissions)) {
                $sections_id = Permission::where('role_id', '=', $this->role_id)->where('allow', true)->pluck('section_id')->toArray();

select * from `groups` where `groups`.`id` = 4 limit 1
---
    public function getUserGroup()
    {
        if (empty($this->user_group)) {
            if (!empty($this->userGroup) and !empty($this->userGroup->group) and $this->userGroup->group->status == 'active') {

select * from `meetings` where `disabled` = 0 and `creator_id` = 1070 limit 1
---
    public function hasMeeting()
    {
        return Meeting::where('disabled', false)
            ->where('creator_id', $this->id)
            ->first();

select * from `follows` where `user_id` = 1070 and `status` = 'accepted'
---
    public function followers()
    {
        return Follow::where('user_id', $this->id)->where('status', Follow::$accepted)->get();

select * from `follows` where `follower` = 1068 and `status` = 'accepted'
---
    public function following()
    {
        return Follow::where('follower', $this->id)->where('status', Follow::$accepted)->get();

select sum(`amount`) as aggregate from `accounting` where `user_id` = 1068 and `type_account` = 'income' and `type` = 'addiction' and `system` = 0 and `tax` = 0
select sum(`amount`) as aggregate from `accounting` where `user_id` = 1068 and `type_account` = 'income' and `type` = 'deduction' and `system` = 0 and `tax` = 0
---
    public function getPayout()
    {
        $credit = Accounting::where('user_id', $this->id)
            ->where('type_account', Accounting::$income)
            ->where('type', Accounting::$addiction)
            ->where('system', false)
            ->where('tax', false)
            ->sum('amount');

        $debit = Accounting::where('user_id', $this->id)
            ->where('type_account', Accounting::$income)
            ->where('type', Accounting::$deduction)
            ->where('system', false)
            ->where('tax', false)
            ->sum('amount');

select sum(`amount`) as aggregate from `accounting` where `user_id` = 1068 and `type` = 'addiction' and `system` = 0 and `tax` = 0
select sum(`amount`) as aggregate from `accounting` where `user_id` = 1068 and `type` = 'deduction' and `system` = 0 and `tax` = 0
---
    public function getAccountingBalance()
    {
        $additions = Accounting::where('user_id', $this->id)
            ->where('type', Accounting::$addiction)
            ->where('system', false)
            ->where('tax', false)
            ->sum('amount');

        $deductions = Accounting::where('user_id', $this->id)
            ->where('type', Accounting::$deduction)
            ->where('system', false)
            ->where('tax', false)
            ->sum('amount');

select * from `notifications` where ((`user_id` = 1068 and `type` = 'single') or (`user_id` is null and `group_id` is null and `type` = 'all_users')) and not exists (select * from `notifications_status` where `notifications`.`id` = `notifications_status`.`notification_id`) order by `created_at` desc
select * from `notifications` where `group_id` = 4 and `type` = 'group' and not exists (select * from `notifications_status` where `notifications`.`id` = `notifications_status`.`notification_id`) order by `created_at` desc
---
    public function getUnReadNotifications()
    {
        $user = $this;

        $notifications = Notification::where(function ($query) {
            $query->where(function ($query) {
                $query->where('user_id', $this->id)
                    ->where('type', 'single');
            })->orWhere(function ($query) {
                if (!$this->isAdmin()) {
                    $query->whereNull('user_id')
                        ->whereNull('group_id')
                        ->where('type', 'all_users');
                }
            });
        })->doesntHave('notificationStatus')
            ->orderBy('created_at', 'desc')
            ->get();

        $userGroup = $this->userGroup()->first();
        if (!empty($userGroup)) {
            $groupNotifications = Notification::where('group_id', $userGroup->group_id)
                ->where('type', 'group')
                ->doesntHave('notificationStatus')
                ->orderBy('created_at', 'desc')
                ->get();

select * from `notifications` where `user_id` is null and `group_id` is null and `type` = 'students' and not exists (select * from `notifications_status` where `notifications`.`id` = `notifications_status`.`notification_id`) order by `created_at` desc
---
        }

        if ($this->isUser()) {
            $studentsNotifications = Notification::whereNull('user_id')
                ->whereNull('group_id')
                ->where('type', 'students')
                ->doesntHave('notificationStatus')
                ->orderBy('created_at', 'desc')
                ->get();

select * from `notifications` where `user_id` is null and `group_id` is null and `type` = 'instructors' and not exists (select * from `notifications_status` where `notifications`.`id` = `notifications_status`.`notification_id`) order by `created_at` desc
---
        }

        if ($this->isTeacher()) {
            $instructorNotifications = Notification::whereNull('user_id')
                ->whereNull('group_id')
                ->where('type', 'instructors')
                ->doesntHave('notificationStatus')
                ->orderBy('created_at', 'desc')
                ->get();

select * from `notifications` where `webinar_id` in (2031) and `type` = 'course_students' and not exists (select * from `notifications_status` where `notifications`.`id` = `notifications_status`.`notification_id` and `user_id` = 1068) order by `created_at` desc
---
        $userBoughtWebinarsIds = $this->getAllPurchasedWebinarsIds();

        if (!empty($userBoughtWebinarsIds)) {
            $courseStudentsNotifications = Notification::whereIn('webinar_id', $userBoughtWebinarsIds)
                ->where('type', 'course_students')
                ->whereDoesntHave('notificationStatus', function ($query) use ($user) {
                    $query->where('user_id', $user->id);
                })
                ->orderBy('created_at', 'desc')
                ->get();

select * from `sales` where `buyer_id` = 1068 and `webinar_id` is not null and `refund_at` is null
---
    public function getAllPurchasedWebinarsIds()
    {
        $userBoughtWebinarsIds = [];
        $userBoughtWebinars = Sale::query()->where('buyer_id', $this->id)
            ->whereNotNull('webinar_id')
            ->whereNull('refund_at')
            ->get();

select `teacher_id` from `webinars` where `id` in (2031, 2026)
---
    public function getUnreadNoticeboards()
    {
        $purchasedCoursesIds = $this->getPurchasedCoursesIds();
        $purchasedCoursesInstructorsIds = Webinar::whereIn('id', $purchasedCoursesIds)
            ->pluck('teacher_id')
            ->toArray();

select * from `sales` where `buyer_id` = 1068 and (`webinar_id` is not null or `bundle_id` is not null) and `refund_at` is null
---
    public function getPurchasedCoursesIds()
    {
        $webinarIds = [];
        $bundleIds = [];

        $sales = Sale::where('buyer_id', $this->id)
            ->where(function ($query) {
                $query->whereNotNull('webinar_id');
                $query->orWhereNotNull('bundle_id');
            })
            ->whereNull('refund_at')
            ->get();