app/Helpers/helper.php

select `settings`.*, `setting_translations`.`value` from `settings` inner join `setting_translations` on `settings`.`id` = `setting_translations`.`setting_id` where `page` = 'general' and `name` = 'general' limit 1
---
function getDefaultLocale()
{
    $key = 'site_language';
    $name = \App\Models\Setting::$generalName;

    /// I did not use the helper method because the Setting model uses translation and may get stuck in the loop.

    $setting = cache()->remember('settings.getDefaultLocale', 24 * 60 * 60, function () use ($name) {
        $setting = \Illuminate\Support\Facades\DB::table('settings')
            ->where('page', $name)
            ->where('name', $name)
            ->join('setting_translations', 'settings.id', '=', 'setting_translations.setting_id')
            ->select('settings.*', 'setting_translations.value')
            ->first();

select * from `notification_templates` where `id` = '5' limit 1
select * from `notifications` where `user_id` = '1070' and `group_id` is null and `title` = 'Course approve' and `message` = '<p>your course with title Programación Web approved</p>' and `sender` = 'system' and `type` = 'single' limit 1
insert into `notifications` (`user_id`, `group_id`, `title`, `message`, `sender`, `type`, `created_at`) values ('1070', '', 'Course approve', '<p>your course with title Programación Web approved</p>', 'system', 'single', 1701450871)
select * from `users` where `id` = '1070' limit 1
---
function sendNotification($template, $options, $user_id = null, $group_id = null, $sender = 'system', $type = 'single')
{
    $templateId = getNotificationTemplates($template);
    $notificationTemplate = \App\Models\NotificationTemplate::where('id', $templateId)->first();

    if (!empty($notificationTemplate)) {
        $title = str_replace(array_keys($options), array_values($options), $notificationTemplate->title);
        $message = str_replace(array_keys($options), array_values($options), $notificationTemplate->template);

        $check = \App\Models\Notification::where('user_id', $user_id)
            ->where('group_id', $group_id)
            ->where('title', $title)
            ->where('message', $message)
            ->where('sender', $sender)
            ->where('type', $type)
            ->first();

        $ignoreDuplicateTemplates = ['new_badge', 'registration_package_expired'];

        if (empty($check) or !in_array($template, $ignoreDuplicateTemplates)) {
            \App\Models\Notification::create([
                'user_id' => $user_id,
                'group_id' => $group_id,
                'title' => $title,
                'message' => $message,
                'sender' => $sender,
                'type' => $type,
                'created_at' => time()
            ]);

            if (env('APP_ENV') == 'production') {
                $user = \App\User::where('id', $user_id)->first();

select * from `notification_templates` where `id` = 121 limit 1
select * from `notifications` where `user_id` = 1068 and `group_id` is null and `title` = 'Waiting task result' and `message` = '<p>course curso prueba&nbsp;calculated task Subir codigo PHP result passed by instructor</p>' and `sender` = 'system' and `type` = 'single' limit 1
insert into `notifications` (`user_id`, `group_id`, `title`, `message`, `sender`, `type`, `created_at`) values (1068, '', 'Waiting task result', '<p>course curso prueba&nbsp;calculated task Subir codigo PHP result passed by instructor</p>', 'system', 'single', 1701097487)
select * from `users` where `id` = 1068 limit 1
---
function sendNotificationTask($template, $options, $user_id = null, $group_id = null, $sender = 'system', $type = 'single')
{
    $notificationTemplate = \App\Models\NotificationTemplate::where('id', $template)->first();

    if (!empty($notificationTemplate)) {
        $title = str_replace(array_keys($options), array_values($options), $notificationTemplate->title);
        $message = str_replace(array_keys($options), array_values($options), $notificationTemplate->template);

        $check = \App\Models\Notification::where('user_id', $user_id)
            ->where('group_id', $group_id)
            ->where('title', $title)
            ->where('message', $message)
            ->where('sender', $sender)
            ->where('type', $type)
            ->first();

        $ignoreDuplicateTemplates = ['new_badge', 'registration_package_expired'];

        if (empty($check) or !in_array($template, $ignoreDuplicateTemplates)) {
            \App\Models\Notification::create([
                'user_id' => $user_id,
                'group_id' => $group_id,
                'title' => $title,
                'message' => $message,
                'sender' => $sender,
                'type' => $type,
                'created_at' => time()
            ]);

            if (env('APP_ENV') == 'production') {
                $user = \App\User::where('id', $user_id)->first();

select * from `navbar_buttons` where `role_id` is null and `for_guest` = 1 limit 1
---
function getNavbarButton($roleId = null, $forGuest = false)
{
    return \App\Models\NavbarButton::where('role_id', $roleId)
        ->where('for_guest', $forGuest)
        ->first();