app/Http/Controllers/Panel/TaskController.php

select `id`, `webinar_id` from `tasks` where `creator_id` = 1070 and `status` = 'active'
select `id`, `group_id`, `webinar_id` from `tasks` where `creator_id` = 1070 and `status` = 'active'
select distinct `webinar_id` from `tasks` where `creator_id` = 1070 and `status` = 'active'
select count(*) as aggregate from `tasks` where `creator_id` = 1070
select * from `webinars` where `webinars`.`id` in (2031)
---
    public function index(Request $request)
    {
        $user = auth()->user();

        $allTasksLists = Task::select('id', 'webinar_id')
            ->where('creator_id', $user->id)
            ->where('status', 'active')
            ->get();

        $allGroupsLists = Task::select('id', 'group_id', 'webinar_id')
            ->where('creator_id', $user->id)
            ->where('status', 'active')
            ->get();


        $query = Task::where('creator_id', $user->id);

        $webinars = Task::select('webinar_id')
            ->where('creator_id', $user->id)
            ->where('status', 'active')
            ->distinct()
            ->get();

        $tasksCount = deepClone($query)->count();

        $webinarCount = deepClone($webinars)->count();

        $taskFilters = $this->filters($request, $query);

        $tasks = $taskFilters->with([
            'webinar',
            'taskResults',
        ])->orderBy('created_at', 'desc')
            ->orderBy('updated_at', 'desc')
            ->paginate(10);

select * from `webinars` where (`teacher_id` = 1070 or `creator_id` = 1070)
---
    public function create(Request $request)
    {
        $user = auth()->user();
        $webinars = Webinar::where(function ($query) use ($user) {
            $query->where('teacher_id', $user->id)
                ->orWhere('creator_id', $user->id);
        })->get();

select * from `webinars` where `webinars`.`id` = '2031' limit 1
---
    public function getAllByWebinarId($webinar_id)
    {
        $user = auth()->user();

        $webinar = Webinar::find($webinar_id);

select * from `webinars` where (`teacher_id` = 1070 or `creator_id` = 1070)
---
    public function store(Request $request)
    {
        $data = $request->get('ajax')['new'];
        $locale = $data['locale'] ?? getDefaultLocale();

        $rules = [
            'title' => 'required|max:255',
            'webinar_id' => 'required',
            'group_id' => 'required',
            'expiry_days' => 'required|date_format:Y-m-d\TH:i',
            'description' => 'required|min:2',
            'attach' => 'nullable|string',
        ];

        $validate = Validator::make($data, $rules);

        if ($validate->fails()) {
            return response()->json([
                'code' => 422,
                'errors' => $validate->errors()
            ], 422);
        }

        $user = auth()->user();

        $webinar = null;
        $group = null;
        if (!empty($data['webinar_id'])) {
            $webinar = Webinar::where('id', $data['webinar_id'])
                ->where(function ($query) use ($user) {
                    $query->where('teacher_id', $user->id)
                        ->orWhere('creator_id', $user->id);
                })->first();

select * from `webinars` where (`teacher_id` = 1070 or `creator_id` = 1070)
select * from `tasks` where `id` = '54' and (`creator_id` = 1070) limit 1
---
    public function edit(Request $request, $id)
    {
        $user = auth()->user();
        $webinars = Webinar::where(function ($query) use ($user) {
            $query->where('teacher_id', $user->id)
                ->orWhere('creator_id', $user->id);
        })->get();

        $webinarIds = $webinars->pluck('id')->toArray();

        $task = Task::where('id', $id)
            ->where('creator_id', $user->id)
            ->where(function ($query) use ($user, $webinarIds) {
                $query->where('creator_id', $user->id);
                $query->orWhereIn('webinar_id', $webinarIds);
            })
            ->first();

select * from `tasks` where `id` = '76' and (`creator_id` = 1070) limit 1
---
    public function update(Request $request, $id)
    {
        $user = auth()->user();

        $webinar = null;
        if (!empty($data['webinar_id'])) {
            $webinar = Webinar::where('id', $data['webinar_id'])
                ->where(function ($query) use ($user) {
                    $query->where('teacher_id', $user->id)
                        ->orWhere('creator_id', $user->id);
                })->first();
        }


        $task = Task::query()->where('id', $id)
            ->where(function ($query) use ($user, $webinar) {
                $query->where('creator_id', $user->id);

                if (!empty($webinar)) {
                    $query->orWhere('webinar_id', $webinar->id);
                }
            })
            ->first();

select * from `task_translations` where (`task_id` = 76 and `locale` = 'es') limit 1
---
            ]);


            TaskTranslation::updateOrCreate([
                'task_id' => $task->id,
                'locale' => mb_strtolower($data['locale']),
            ], [
                'title' => $data['title'],
            ]);

select * from `tasks` where `id` = '44' limit 1
---
    public function destroy(Request $request, $id)
    {
        $user = auth()->user();
        $task = Task::where('id', $id)
            ->first();

select * from `tasks_results` where `user_id` = 1068 order by `created_at` desc limit 10 offset 0
---
    public function status($taskResultId)
    {
        $user = auth()->user();

        $taskResult = TasksResult::where('id', $taskResultId)
            ->where('user_id', $user->id)
            ->first();

select * from `tasks` where `webinar_id` in (2031, 2026) and `status` = 'active' and not exists (select * from `tasks_results` where `tasks`.`id` = `tasks_results`.`task_id` and `user_id` = 1068)
select `full_name`, `id` from `users` where `id` in (1016, 1070)
select `teacher_id` from `webinars` where `id` in (2031, 2026)
---
    public function myResults(Request $request)
    {
        $user = auth()->user();

        $webinarIds = $user->getPurchasedCoursesIds();
        $userGroupIds = GroupStudent::where('user_id', $user->id)->pluck('group_id');
        $query = TasksResult::where('user_id', auth()->user()->id);


        $taskResultsCount = deepClone($query)->count();
        $passedCount = deepClone($query)->where('status', \App\Models\TasksResult::$passed)->count();
        $failedCount = deepClone($query)->where('status', \App\Models\TasksResult::$failed)->count();
        $waitingCount = deepClone($query)->where('status', \App\Models\TasksResult::$waiting)->count();

        $allTasksWebinars = Task::whereIn('group_id', $userGroupIds)
            ->whereIn('webinar_id', $webinarIds)
            ->where('status', 'active')
            ->whereHas('taskResults', function ($query) use ($user) {
                $query->where('user_id', $user->id);
            })
            ->get();

        $allInstructorsIds = Webinar::whereIn('id', $webinarIds)
            ->pluck('teacher_id')
            ->toArray();

        $allInstructors = User::whereIn('id', $allInstructorsIds)
            ->pluck('full_name', 'id')
            ->toArray();

select `group_id` from `group_students` where `user_id` = 1068
select * from `tasks` where `group_id` in (7, 4) and `webinar_id` in (2032, 2031) and `status` = 'active' and not exists (select * from `tasks_results` where `tasks`.`id` = `tasks_results`.`task_id` and `user_id` = 1068)
select `teacher_id` from `webinars` where `id` in (2032, 2031)
select `full_name`, `id` from `users` where `id` in (1070, 1070)
---
    public function opens(Request $request)
    {
        $user = auth()->user();

        $webinarIds = $user->getPurchasedCoursesIds();

        $userGroupIds = GroupStudent::where('user_id', $user->id)->pluck('group_id');

        $query = Task::whereIn('group_id', $userGroupIds)
            ->whereIn('webinar_id', $webinarIds)
            ->where('status', 'active')
            ->whereDoesntHave('taskResults', function ($query) use ($user) {
                $query->where('user_id', $user->id);
            });

        $allTasksWebinars = Task::whereIn('group_id', $userGroupIds)
            ->whereIn('webinar_id', $webinarIds)
            ->where('status', 'active')
            ->whereDoesntHave('taskResults', function ($query) use ($user) {
                $query->where('user_id', $user->id);
            })
            ->get();

        $allInstructorsIds = Webinar::whereIn('id', $webinarIds)
            ->pluck('teacher_id')
            ->toArray();

        $allInstructors = User::whereIn('id', $allInstructorsIds)
            ->pluck('full_name', 'id')
            ->toArray();

select * from `tasks_results` where `id` = '229' and `task_id` = 54 limit 1
---
    public function destroyTaskResult($taskResultId)
    {
        $user = auth()->user();

        $tasksIds = Task::where('creator_id', $user->id)->pluck('id')->toArray();

        $taskResult = TasksResult::where('id', $taskResultId)
            ->whereIn('task_id', $tasksIds)
            ->first();

select * from `tasks` where `tasks`.`id` in (54)
---
    public function editResult_student($taskResultId)
    {
        $user = auth()->user();
        $task = TasksResult::find($taskResultId)->task;