app/Http/Controllers/Web/WebinarController.php

                    $query->with([
                        'user' => function ($query) {
                            $query->select('id', 'full_name', 'role_name', 'role_id', 'avatar', 'avatar_settings');
                        },
                        'replies' => function ($query) {
                            $query->where('status', 'active');
                            $query->with([
                                'user' => function ($query) {
                                    $query->select('id', 'full_name', 'role_name', 'role_id', 'avatar', 'avatar_settings');
                                }
                            ]);
                        }
                    ]);
                    $query->orderBy('created_at', 'desc');
                },
            ])
            ->withCount([
                'sales' => function ($query) {
                    $query->whereNull('refund_at');
                },
                'noticeboards'
            ])
            ->where('status', 'active')
            ->first();
---
select * from `users` where `users`.`id` in (1070)

        $isFavorite = false;

        if (!empty($user)) {
            $isFavorite = Favorite::where('webinar_id', $course->id)
                ->where('user_id', $user->id)
                ->first();
---
select * from `favorites` where `webinar_id` = 2031 and `user_id` = 1068 limit 1

            $webinarContentCount += $course->assignments->count();
        }

        $advertisingBanners = AdvertisingBanner::where('published', true)
            ->whereIn('position', ['course', 'course_sidebar'])
            ->get();
        if (!empty($user)) {
            $attendances= AttendanceTranslation::where('student_id',$user->id)
                ->join('attendances', 'attendances.id', '=', 'attendance_translations.attendance_id')
                ->select( 'attendance_translations.*','attendances.date','attendances.updated_at','attendances.text_lesson_id')
                ->get();
---
select * from `advertising_banners` where `published` = 1 and `position` in ('course', 'course_sidebar')
select `attendance_translations`.*, `attendances`.`date`, `attendances`.`updated_at`, `attendances`.`text_lesson_id` from `attendance_translations` inner join `attendances` on `attendances`.`id` = `attendance_translations`.`attendance_id` where `student_id` = 1068

    private function checkTaskResults($user, $task)
    {
        $canDownloadCertificate = false;

        $canTryAgainTask = false;
        $userTaskDone = TasksResult::where('task_id', $task->id)
            ->where('user_id', $user->id)
            ->orderBy('created_at', 'desc')
            ->get();
---
select * from `tasks_results` where `task_id` = 44 and `user_id` = 1068 order by `created_at` desc