app/Models/Webinar.php

select * from `tickets` where `webinar_id` = 2032
---
    public function getDiscountPercent()
    {
        $percent = 0;

        $activeSpecialOffer = $this->activeSpecialOffer();

        if (!empty($activeSpecialOffer)) {
            $percent += $activeSpecialOffer->percent;
        }

        $tickets = Ticket::where('webinar_id', $this->id)->get();

select * from `sales` where `buyer_id` = 1068 and `webinar_id` = 2031 and `type` = 'webinar' and `refund_at` is null and `access_to_purchased_item` = 1 order by `created_at` desc limit 1
---
    public function getSaleItem($user = null)
    {
        if (empty($user)) {
            $user = auth()->user();
        }

        if (!empty($user)) {
            return Sale::query()->where('buyer_id', $user->id)
                ->where('webinar_id', $this->id)
                ->where('type', 'webinar')
                ->whereNull('refund_at')
                ->where('access_to_purchased_item', true)
                ->orderBy('created_at', 'desc')
                ->first();

select * from `bundle_webinars` where `webinar_id` = 2026
---
            }

            if (!$hasBought) {
                $bundleWebinar = BundleWebinar::where('webinar_id', $this->id)
                    ->with([
                        'bundle'
                    ])->get();

select * from `gifts` where `email` = 'jeinerrobles53@gmail.com' and `status` = 'active' and `webinar_id` = 2026 and (`date` is null or `date` < 1701099222) and exists (select * from `sales` where `gifts`.`id` = `sales`.`gift_id`) limit 1
---

            /* Check Gift */
            if (!$hasBought) {
                $gift = Gift::query()->where('email', $user->email)
                    ->where('status', 'active')
                    ->where('webinar_id', $this->id)
                    ->where(function ($query) {
                        $query->whereNull('date');
                        $query->orWhere('date', '<', time());
                    })
                    ->whereHas('sale')
                    ->first();

select * from `installment_orders` where `user_id` = 1068 and `webinar_id` = 2026 and `status` = 'open' and `refund_at` is null limit 1
---
    public function getInstallmentOrder()
    {
        $user = auth()->user();

        if (!empty($user)) {
            return InstallmentOrder::query()->where('user_id', $user->id)
                ->where('webinar_id', $this->id)
                ->where('status', 'open')
                ->whereNull('refund_at')
                ->first();

select * from `files` where `files`.`webinar_id` = 2031 and `files`.`webinar_id` is not null and `status` = 'active'
---
    public function getFilesLearningProgressStat($userId = null)
    {
        $passed = 0;

        if (empty($userId)) {
            $userId = auth()->id();
        }

        $files = $this->files()
            ->where('status', 'active')
            ->get();

select * from `text_lessons` where `text_lessons`.`webinar_id` = 2031 and `text_lessons`.`webinar_id` is not null and `status` = 'active'
select * from `course_learning` where `user_id` = 1 and `text_lesson_id` = 73 limit 1
---
    public function getTextLessonsLearningProgressStat($userId = null)
    {
        $passed = 0;

        if (empty($userId)) {
            $userId = auth()->id();
        }

        $textLessons = $this->textLessons()
            ->where('status', 'active')
            ->get();

        foreach ($textLessons as $textLesson) {
            $status = CourseLearning::where('user_id', $userId)
                ->where('text_lesson_id', $textLesson->id)
                ->first();

select * from `webinar_assignment_history` where `assignment_id` = 6 and `student_id` = 1 and `status` = 'passed' limit 1
---
    public function getAssignmentsLearningProgressStat($userId = null)
    {
        $passed = 0;

        if (empty($userId)) {
            $userId = auth()->id();
        }

        $assignments = $this->assignments()
            ->where('status', 'active')
            ->get();

        foreach ($assignments as $assignment) {
            $assignmentHistory = WebinarAssignmentHistory::where('assignment_id', $assignment->id)
                ->where('student_id', $userId)
                ->where('status', WebinarAssignmentHistory::$passed)
                ->first();

select * from `quizzes` where `quizzes`.`webinar_id` = 2031 and `quizzes`.`webinar_id` is not null and `status` = 'active'
---
    public function getQuizzesLearningProgressStat($userId = null)
    {
        $passed = 0;

        if (empty($userId)) {
            $userId = auth()->id();
        }

        $quizzes = $this->quizzes()
            ->where('status', 'active')
            ->get();

select * from `tasks` where `tasks`.`webinar_id` = 2031 and `tasks`.`webinar_id` is not null and `status` = 'active'
select * from `tasks_results` where `task_id` = 75 and `user_id` = 1 and `status` = 'passed' limit 1
---
    public function getTasksLearningProgressStat($userId = null)
    {
        $passed = 0;

        if (empty($userId)) {
            $userId = auth()->id();
        }

        $tasks = $this->tasks()
            ->where('status', 'active')
            ->get();

        foreach ($tasks as $task) {
            $taskHistory = TasksResult::where('task_id', $task->id)
                ->where('user_id', $userId)
                ->where('status', TasksResult::$passed)
                ->first();

select * from `special_offers` where `webinar_id` = 2032 and `status` = 'active' and `from_date` < 1701450813 and `to_date` > 1701450813 limit 1
---
    public function activeSpecialOffer()
    {
        $activeSpecialOffer = SpecialOffer::where('webinar_id', $this->id)
            ->where('status', SpecialOffer::$active)
            ->where('from_date', '<', time())
            ->where('to_date', '>', time())
            ->first();