app/Http/Controllers/Admin/EnrollmentController.php

select * from `webinars` where `webinars`.`id` = '2032' limit 1
---
    public function getAllByWebinarId($webinar_id)
    {

        $webinar = Webinar::find($webinar_id);

select * from `users` where `users`.`id` = '1068' limit 1
---
            }
        }

        $user = User::find($data['user_id']);

select * from `webinars` where `webinars`.`id` = '2032' limit 1
---
            $product = null;

            if (!empty($data['webinar_id'])) {
                $course = Webinar::find($data['webinar_id']);