app/Http/Controllers/Admin/WebinarController.php

    public function index(Request $request)
    {
        $this->authorize('admin_webinars_list');

        removeContentLocale();

        $type = $request->get('type', 'webinar');
        $query = Webinar::where('webinars.type', $type);

        $totalWebinars = $query->count();
        $totalPendingWebinars = deepClone($query)->where('webinars.status', 'pending')->count();
        $totalDurations = deepClone($query)->sum('duration');
        $totalSales = deepClone($query)->join('sales', 'webinars.id', '=', 'sales.webinar_id')
            ->select(DB::raw('count(sales.webinar_id) as sales_count'))
            ->whereNotNull('sales.webinar_id')
            ->whereNull('sales.refund_at')
            ->first();

        $categories = Category::where('parent_id', null)
            ->with('subCategories')
            ->get();
---
select count(*) as aggregate from `webinars` where `webinars`.`type` = 'course'
select count(*) as aggregate from `webinars` where `webinars`.`type` = 'course' and `webinars`.`status` = 'pending'
select sum(`duration`) as aggregate from `webinars` where `webinars`.`type` = 'course'
select count(sales.webinar_id) as sales_count from `webinars` inner join `sales` on `webinars`.`id` = `sales`.`webinar_id` where `webinars`.`type` = 'course' and `sales`.`webinar_id` is not null and `sales`.`refund_at` is null limit 1
select * from `categories` where `parent_id` is null

        }

        foreach ($webinars as $webinar) {
            $giftsIds = Gift::query()->where('webinar_id', $webinar->id)
                ->where('status', 'active')
                ->where(function ($query) {
                    $query->whereNull('date');
                    $query->orWhere('date', '<', time());
                })
                ->whereHas('sale')
                ->pluck('id')
                ->toArray();

            $sales = Sale::query()
                ->where(function ($query) use ($webinar, $giftsIds) {
                    $query->where('webinar_id', $webinar->id);
                    $query->orWhereIn('gift_id', $giftsIds);
                })
                ->whereNull('refund_at')
                ->get();
---
select `id` from `gifts` where `webinar_id` = 2032 and `status` = 'active' and (`date` is null or `date` < 1701450813) and exists (select * from `sales` where `gifts`.`id` = `sales`.`gift_id`)
select * from `sales` where (`webinar_id` = 2032 or 0 = 1) and `refund_at` is null

    public function create3()
    {
        removeContentLocale();

        $this->authorize('admin_store_categories_list');
        $categories = course_group::get();
        $teachers = User::where('role_name', Role::$teacher)->get();
        $course = Webinar::where('type', 'course')->get();
---
select * from `users` where `role_name` = 'teacher'
select * from `webinars` where `type` = 'course'

    public function edit(Request $request, $id)
    {
        $this->authorize('admin_webinars_edit');
        $studyPlanChapters =StudyPlanChapter::where('webinar_id',$id)->get();
---
select * from `study_plan_chapters` where `webinar_id` = '2032'

        $locale = $request->get('locale', app()->getLocale());
        storeContentLocale($locale, $webinar->getTable(), $webinar->id);

        $categories = Category::where('parent_id', null)
            ->with('subCategories')
            ->get();
---
select * from `categories` where `parent_id` is null

    public function update(Request $request, $id)
    {
        $this->authorize('admin_webinars_edit');
        $data = $request->all();

        $webinar = Webinar::find($id);
        $isDraft = (!empty($data['draft']) and $data['draft'] == 1);
        $reject = (!empty($data['draft']) and $data['draft'] == 'reject');
        $publish = (!empty($data['draft']) and $data['draft'] == 'publish');

        $rules = [
            'type' => 'required|in:webinar,course,text_lesson,classroom_course',
            'title' => 'required|max:255',
            'slug' => 'max:255|unique:webinars,slug,' . $webinar->id,
            'thumbnail' => 'required',
            'image_cover' => 'required',
            'description' => 'required',
            'teacher_id' => 'required|exists:users,id',
            'category_id' => 'required',
        ];

        if ($webinar->isWebinar()) {
            $rules['start_date'] = 'required|date';
            $rules['duration'] = 'required';
            $rules['capacity'] = 'required|integer';
        }

        $this->validate($request, $rules);

        if (!empty($data['teacher_id'])) {
            $teacher = User::find($data['teacher_id']);
---
select * from `webinars` where `webinars`.`id` = '2031' limit 1
select * from `users` where `users`.`id` = '1070' limit 1

        }

        if ($data['category_id'] !== $webinar->category_id) {
            WebinarFilterOption::where('webinar_id', $webinar->id)->delete();
---
delete from `webinar_filter_option` where `webinar_id` = 2031

        }

        if (!empty($request->get('partner_instructor')) and !empty($request->get('partners'))) {
            WebinarPartnerTeacher::where('webinar_id', $webinar->id)->delete();

            foreach ($request->get('partners') as $partnerId) {
                WebinarPartnerTeacher::create([
                    'webinar_id' => $webinar->id,
                    'teacher_id' => $partnerId,
                ]);
---
delete from `webinar_partner_teacher` where `webinar_id` = 2031
insert into `webinar_partner_teacher` (`webinar_id`, `teacher_id`) values (2031, '1070')

        ]);

        if ($webinar) {
            WebinarTranslation::updateOrCreate([
                'webinar_id' => $webinar->id,
                'locale' => mb_strtolower($data['locale']),
            ], [
                'title' => $data['title'],
                'description' => $data['description'],
                'seo_description' => $data['seo_description'],
            ]);
---
select * from `webinar_translations` where (`webinar_id` = 2031 and `locale` = 'es') limit 1

    public function search(Request $request)
    {
        $term = $request->get('term');

        $option = $request->get('option', null);

        $query = Webinar::select('id')
            ->whereTranslationLike('title', "%$term%");

        if (!empty($option) and $option == 'just_webinar') {
            $query->where('type', Webinar::$webinar);
            $query->where('status', Webinar::$active);
        }

        $webinar = $query->get();
---
select `id` from `webinars` where exists (select * from `webinar_translations` where `webinars`.`id` = `webinar_translations`.`webinar_id` and `webinar_translations`.`title` LIKE '%pro%')